### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [267]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [ ]:
#Check the purchase data
purchase_data.head()

In [269]:
#Read the purchase data into a dataframe
purchase_data_df = pd.DataFrame(purchase_data)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [270]:
#Find the number of total players
player_count = purchase_data_df["SN"].nunique()
player_count

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [271]:
#Find out how many unique games was played by all players
unique_items = purchase_data_df["Item Name"].nunique()
unique_items

179

In [272]:
#To be able to find the average price per game, need to find the total price of all the games purchased first
total_price = pd.Series(purchase_data_df['Price'].sum(), index = ['Price'])
total_price

Price    2379.77
dtype: float64

In [273]:
#Now that we know the total price, find the average price per game
average_price = round(total_price / player_count, 2)
average_price

Price    4.13
dtype: float64

In [274]:
#Put the calculated figures found into a summary table
summary_table = pd.DataFrame({"Total Unique Games": unique_items,
                              "Total Players": player_count,
                              "Total Cost for Games": total_price,
                              "Average Cost per Game": average_price})
summary_table

,Total Unique Games,Total Players,Total Cost for Games,Average Cost per Game
Price,179,576,2379.77,4.13

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [275]:
#Find the count and percentage of the Male players
gender_split = purchase_data_df["Gender"].value_counts()
gender_split_percentage = round(purchase_data_df["Gender"].value_counts(normalize=True) * 100, 2)
print(gender_split)
print(gender_split_percentage)

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64
Male                     83.59
Female                   14.49
Other / Non-Disclosed     1.92
Name: Gender, dtype: float64


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [276]:
#Find the number of total purchases by Gender
grouped_gender = purchase_data_df.groupby("Gender")
grouped_gender.count()["Purchase ID"]

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [277]:
a=purchase_data_df.groupby(["Gender"]).count()["Price"].rename("Total Count")
b= purchase_data_df.groupby(["Gender"]).sum()["Price"].rename("Total Price")
c=purchase_data_df.groupby(["Gender"]).mean()["Price"].rename("Avg Price")

In [278]:
#Put the calculated figures found into a summary table by gender
summary_table_gender = pd.DataFrame({"Total Games by Gender": a,
                              "Avg Price by Gender": b,
                              "Total Price by Gender": c
                              })
summary_table_gender

,Total Games by Gender,Avg Price by Gender,Total Price by Gender
Gender,,,
Female,113,361.94,3.203009
Male,652,1967.64,3.017853
Other / Non-Disclosed,15,50.19,3.346000

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [ ]:
purchase_data_df.head()

In [280]:
#Create bins for the different age groups and assign labels.
bin_age = [0,9.9,14.9,19.9,24.9,29.9,34.9,39.9,9999]
bin_label = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [281]:
#Execute the bin function to distribute the values to different bins with labels
pd.cut(purchase_data_df["Age"], bin_age, labels=bin_label)

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    20-24
778      <10
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [282]:
# Place the age group data series into a new column inside of the DataFrame
purchase_data_df["Age Group"] = pd.cut(purchase_data_df["Age"], bin_age, labels=bin_label)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [283]:
#Group all the purchases by age group
a=purchase_data_df.groupby(["Age Group"]).count()["Price"].rename("Purchase Count")
b=purchase_data_df.groupby(["Age Group"]).mean()["Price"].rename("Avg Purchase Price")
c= purchase_data_df.groupby(["Age Group"]).sum()["Price"].rename("Total Purchase Price")

In [284]:
#Put the calculated figures found into a summary table by age group
summary_table_agegroup = pd.DataFrame({"Total Games by Age Group": a,
                              "Avg Price by Age Group": b,
                              "Total Price by Gender": c
                              })
summary_table_agegroup

,Total Games by Age Group,Avg Price by Age Group,Total Price by Gender
Age Group,,,
<10,23,3.353478,77.13
10-14,28,2.956429,82.78
15-19,136,3.035956,412.89
20-24,365,3.052219,1114.06
25-29,101,2.900990,293.00
30-34,73,2.931507,214.00
35-39,41,3.601707,147.67
40+,13,2.941538,38.24

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [285]:
# Calculate purchase count, average price and total price based on screenname
a=purchase_data_df.groupby(["SN"]).count()["Price"].rename("Purchase Count")
b=purchase_data_df.groupby(["SN"]).mean()["Price"].rename("Avg Purchase Price")
c= purchase_data_df.groupby(["SN"]).sum()["Price"].rename("Total Purchase Price")

In [ ]:
#Put the calculated figures found into a summary table by screenname
summary_table_SN = pd.DataFrame({"Games Purchased by SN": a,
                              "Avg Price Paid by SN": b,
                              "Total Price Paid by SN": c
                              })
summary_table_SN.head()

In [287]:
#Sort values by total price paid column
summary_table_SN.sort_values("Total Price Paid by SN", ascending=False).head()

,Games Purchased by SN,Avg Price Paid by SN,Total Price Paid by SN
SN,,,
Lisosia93,5,3.792000,18.96
Idastidru52,4,3.862500,15.45
Chamjask73,3,4.610000,13.83
Iral74,4,3.405000,13.62
Iskadarya95,3,4.366667,13.10

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [288]:
#Retrieve Item ID, Item Name and Item Price columns
purchase_data_df2 = purchase_data_df.loc[:,'Item ID':'Price']
purchase_data_df2.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [289]:
#Group by Item ID and Item Name
# Calculate purchase count, price and total price based on groupings
a=purchase_data_df.groupby(["Item ID","Item Name"]).count()["Price"].rename("Purchase Count")
b=purchase_data_df.groupby(["Item ID","Item Name"]).mean()["Price"].rename("Avg Purchase Price")
c= purchase_data_df.groupby(["Item ID","Item Name"]).sum()["Price"].rename("Total Purchase Price")

In [290]:
#Put the calculated figures found into a summary table by groupings
summary_table_groupings = pd.DataFrame({"Purchase Count": a,
                              "Avg Price": b,
                              "Total Purchase Value": c
                              })
summary_table_groupings.head()

                            Purchase Count  Avg Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4       1.28                  5.12
1       Crucifer                         3       3.26                  9.78
2       Verdict                          6       2.48                 14.88
3       Phantomlight                     6       2.49                 14.94
4       Bloodlord's Fetish               5       1.70                  8.50

In [291]:
#Sort values by purchase count column in descending order
summary_table_groupings.sort_values("Purchase Count", ascending=False).head()

,,Purchase Count,Avg Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [292]:
#Sort values by total purchase value column in descending order
summary_table_groupings.sort_values("Total Purchase Value", ascending=False).head()

,,Purchase Count,Avg Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80